Load all libraries

In [2]:
import pandas as pd
import numpy as np
import time
import datetime as dt
import sklearn.cluster as cluster
from sklearn.cluster import KMeans
from sklearn.decomposition import PCA
from sklearn.metrics import silhouette_samples, silhouette_score
from pandas.plotting import scatter_matrix
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

In [3]:

retail = pd.read_csv("Online retail.csv",encoding='cp874')
retail.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [4]:
retail.shape

(541909, 8)

In [5]:
retail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

Checking the null values in the dataset

In [7]:
retail.isna().sum().sort_values(ascending=False)

CustomerID     135080
Description      1454
Country             0
UnitPrice           0
InvoiceDate         0
Quantity            0
StockCode           0
InvoiceNo           0
dtype: int64

In [8]:
pd.DataFrame(data = (retail.isna().sum() / retail.shape[0]) * 100, index = retail.columns, columns = ['% Null Values'])

             % Null Values
InvoiceNo         0.000000
StockCode         0.000000
Description       0.268311
Quantity          0.000000
InvoiceDate       0.000000
UnitPrice         0.000000
CustomerID       24.926694
Country           0.000000

Dropping the rows with null values in CustomerID column

In [9]:
retail.duplicated().sum()

5268

In [11]:
retail.drop_duplicates(inplace=True)
retail.shape

(536641, 8)

Removing the cancelled orders from the dataset

In [12]:
retail = retail[retail['Quantity'] > 0]
retail.shape

(526054, 8)

In [13]:
pd.DataFrame(data=[retail['InvoiceNo'].nunique(),retail['StockCode'].nunique(),retail['CustomerID'].nunique()],columns=['Count'],
                   index=['Number of Transactions','Number of Unique Products Bought','Number of Unique Customers'])

                                  Count
Number of Transactions            20728
Number of Unique Products Bought   3941
Number of Unique Customers         4339

RFM Analysis

In [16]:
retail['InvoiceDate'] = retail['InvoiceDate'].astype('datetime64')
retail['InvoiceDate'].max()

Timestamp('2011-12-09 12:50:00')

In [17]:
now = dt.date(2011,12,9)
print(now)

2011-12-09

In [18]:
retail['Date'] = retail['InvoiceDate'].apply(lambda x: x.date())

In [19]:
retail.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Date
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,2010-12-01
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010-12-01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,2010-12-01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010-12-01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010-12-01

In [20]:
recency_df = retail.groupby(by='CustomerID', as_index=False)['Date'].max()
recency_df.columns = ['CustomerID','LastPurshaceDate']
recency_df.head()

   CustomerID LastPurshaceDate
0     12346.0       2011-01-18
1     12347.0       2011-12-07
2     12348.0       2011-09-25
3     12349.0       2011-11-21
4     12350.0       2011-02-02

In [21]:
recency_df['Recency'] = recency_df['LastPurshaceDate'].apply(lambda x: (now - x).days)
recency_df.head()

   CustomerID LastPurshaceDate  Recency
0     12346.0       2011-01-18      325
1     12347.0       2011-12-07        2
2     12348.0       2011-09-25       75
3     12349.0       2011-11-21       18
4     12350.0       2011-02-02      310

In [23]:
recency_df.drop('LastPurshaceDate',axis=1,inplace=True)
recency_df.head()

   CustomerID  Recency
0     12346.0      325
1     12347.0        2
2     12348.0       75
3     12349.0       18
4     12350.0      310

Frequency

In [24]:
temp = retail.copy()
temp.drop_duplicates(['InvoiceNo','CustomerID'],keep='first',inplace=True)
frequency_df = temp.groupby(by=['CustomerID'], as_index=False)['InvoiceNo'].count()
frequency_df.columns = ['CustomerID','Frequency']
frequency_df.head()

   CustomerID  Frequency
0     12346.0          1
1     12347.0          7
2     12348.0          4
3     12349.0          1
4     12350.0          1

Monetary

In [25]:
retail['TotalCost'] = retail['Quantity'] * retail['UnitPrice']

In [26]:
retail.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Date,TotalCost
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,2010-12-01,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010-12-01,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,2010-12-01,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010-12-01,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010-12-01,20.34

In [27]:
monetary_df = retail.groupby(by='CustomerID',as_index=False).agg({'TotalCost': 'sum'})
monetary_df.columns = ['CustomerID','Monetary']
monetary_df.head()

   CustomerID  Monetary
0     12346.0  77183.60
1     12347.0   4310.00
2     12348.0   1797.24
3     12349.0   1757.55
4     12350.0    334.40

Create RFM Table

In [28]:
rfm_df = recency_df.merge(frequency_df,on='CustomerID').merge(monetary_df,on='CustomerID')
rfm_df.set_index('CustomerID',inplace=True)
rfm_df.head()

            Recency  Frequency  Monetary
CustomerID
12346.0         325          1  77183.60
12347.0           2          7   4310.00
12348.0          75          4   1797.24
12349.0          18          1   1757.55
12350.0         310          1    334.40

Customer segments with RFM Model

In [29]:
pareto_cutoff = rfm_df['Monetary'].sum() * 0.8
print("The 80% of total revenue is: ",round(pareto_cutoff,2))

The 80% of total revenue is:  7109767.12

In [30]:
customers_ranked = rfm_df
customers_ranked['Rank'] = customers_ranked['Monetary'].rank(ascending=False)
customers_ranked.head()

            Recency  Frequency  Monetary    Rank
CustomerID
12346.0         325          1  77183.60    10.0
12347.0           2          7   4310.00   335.0
12348.0          75          4   1797.24  1004.0
12349.0          18          1   1757.55  1027.0
12350.0         310          1    334.40  3097.0

In [31]:
customers_ranked.sort_values(by='Rank',ascending=True,inplace=True)
customers_ranked.head()

            Recency  Frequency   Monetary  Rank
CustomerID
14646.0           1         74  280206.02   1.0
18102.0           0         60  259657.30   2.0
17450.0           8         46  194390.79   3.0
16446.0           0          2  168472.50   4.0
14911.0           1        201  143711.17   5.0

In [32]:
# Get top 20% of the customers
top_20_cutoff = 4339 * 20 /100
top_20_cutoff

867.8

In [33]:
# Sum the monetary values over the customer with rank <= 868
revenueByTop20 = customers_ranked[customers_ranked['Rank'] <= 868]['Monetary'].sum()
revenueByTop20

6637300.820999999

Applying RFM Score Formula

In [34]:
quantiles = rfm_df.quantile(q=[0.25,0.5,0.75])
quantiles

      Recency  Frequency  Monetary    Rank
0.25     17.0        1.0   306.455  1085.5
0.50     50.0        2.0   668.560  2170.0
0.75    141.5        5.0  1660.315  3254.5

Creation of RFM segmentation table

In [36]:

# Arguments (x = value, p = recency, monetary_value, frequency, d = quartiles dict)
def RScore(x,p,d):
    if x <= d[p][0.25]:
        return 4
    elif x <= d[p][0.50]:
        return 3
    elif x <= d[p][0.75]: 
        return 2
    else:
        return 1

In [37]:
# Arguments (x = value, p = recency, monetary_value, frequency, k = quartiles dict)
def FMScore(x,p,d):
    if x <= d[p][0.25]:
        return 1
    elif x <= d[p][0.50]:
        return 2
    elif x <= d[p][0.75]: 
        return 3
    else:
        return 4

In [38]:
# Create rfm segmentation table
rfm_segmentation = rfm_df
rfm_segmentation['R_Quartile'] = rfm_segmentation['Recency'].apply(RScore, args=('Recency',quantiles,))
rfm_segmentation['F_Quartile'] = rfm_segmentation['Frequency'].apply(FMScore, args=('Frequency',quantiles,))
rfm_segmentation['M_Quartile'] = rfm_segmentation['Monetary'].apply(FMScore, args=('Monetary',quantiles,))

In [39]:
rfm_segmentation.head()

,Recency,Frequency,Monetary,Rank,R_Quartile,F_Quartile,M_Quartile
CustomerID,,,,,,,
14646.0,1,74,280206.02,1.0,4,4,4
18102.0,0,60,259657.30,2.0,4,4,4
17450.0,8,46,194390.79,3.0,4,4,4
16446.0,0,2,168472.50,4.0,4,2,4
14911.0,1,201,143711.17,5.0,4,4,4

In [40]:
rfm_segmentation['RFMScore'] = rfm_segmentation.R_Quartile.map(str) \
                            + rfm_segmentation.F_Quartile.map(str) \
                            + rfm_segmentation.M_Quartile.map(str)
rfm_segmentation.head()

,Recency,Frequency,Monetary,Rank,R_Quartile,F_Quartile,M_Quartile,RFMScore
CustomerID,,,,,,,,
14646.0,1,74,280206.02,1.0,4,4,4,444
18102.0,0,60,259657.30,2.0,4,4,4,444
17450.0,8,46,194390.79,3.0,4,4,4,444
16446.0,0,2,168472.50,4.0,4,2,4,424
14911.0,1,201,143711.17,5.0,4,4,4,444

In [42]:
rfm_segmentation[rfm_segmentation['RFMScore']=='444'].sort_values('Monetary', ascending=False).head(10)

,Recency,Frequency,Monetary,Rank,R_Quartile,F_Quartile,M_Quartile,RFMScore
CustomerID,,,,,,,,
14646.0,1,74,280206.02,1.0,4,4,4,444
18102.0,0,60,259657.30,2.0,4,4,4,444
17450.0,8,46,194390.79,3.0,4,4,4,444
14911.0,1,201,143711.17,5.0,4,4,4,444
14156.0,9,55,117210.08,7.0,4,4,4,444
17511.0,2,31,91062.38,8.0,4,4,4,444
16684.0,4,28,66653.56,11.0,4,4,4,444
14096.0,4,17,65164.79,12.0,4,4,4,444
13694.0,3,50,65039.62,13.0,4,4,4,444
15311.0,0,91,60632.75,14.0,4,4,4,444

How many customers do we have in each segment?

In [43]:
print("Best Customers: ",len(rfm_segmentation[rfm_segmentation['RFMScore']=='444']))
print('Loyal Customers: ',len(rfm_segmentation[rfm_segmentation['F_Quartile']==4]))
print("Big Spenders: ",len(rfm_segmentation[rfm_segmentation['M_Quartile']==4]))
print('Customers at risk of churning: ', len(rfm_segmentation[rfm_segmentation['RFMScore']=='244']))
print('Almost Churned Customers: ',len(rfm_segmentation[rfm_segmentation['RFMScore']=='144']))
print('Churned Customers: ',len(rfm_segmentation[rfm_segmentation['RFMScore']=='111']))

Best Customers:  455
Loyal Customers:  872
Big Spenders:  1085
Customers at risk of churning:  70
Almost Churned Customers:  10
Churned Customers:  441